-- Лабораторна робота №1
-- Студента групи АнД - 31
-- Білухи Назара Романовича
-- Варіант № 1
-- Мета: ознайомитись з основними типами мови. Ознайомитись зi структурою та
-- функцiями Glasgow Haskell Compiller. Набути навичок роботи з iнтерпретатором
-- ghci та визначення найпростiших функцiй.

-- Завдання № 1
-- Наведiть приклади виразiв вказаного типу.
-- [([Integer],[String])]
-- [([1,3,4,5,-1,-22,13], ["Hello", "I", "am", "from", "AnD"])]
    
-- Завдання № 2
-- Визначте два варiанти вказаних далi функцiй, де аргументи будуть представленi 
-- а) як один кортеж 
-- б) без використання кортежiв чи спискiв
-- Умова: Функцiя приймає три числа i перевiряє, чи значення першого з них
-- знаходиться мiж значеннями двох iнших.

function :: Integer -> Integer -> Integer -> Bool  
function a b c = (b < a) && (a < c)     -- :load a1.hs

-- В ході виконання лабораторної роботи ознаймлено з структурою та базовими командами 
-- мови Haskell, також було створено функцію, яка перевіряє чи є перше вхідне число в проміжку між 
-- другим та третім