-- Лабораторна робота №3
-- Студента групи АнД - 31
-- Білухи Назара Романовича
-- Варіант № 1
-- Мета: Набути досвiду визначення та використання функцiй вищого порядку.

-- Завдання №1
-- Переписати список справа налiво.

-- завдання №1 (I варіант)
rever list = foldl (flip (:)) [] list-- Prelude.reverse [...]
-- ghci
-- :l lab_3.hs
-- rever "abcdefg000"
-- "000gfedcba"

-- завдання №1 (ІІ варіант)
rev :: [a] -> [a]
rev [] = []
rev (x:xs) = reverse xs
-- :l lab_3.hs
-- rev "abcdefg000"
-- "000gfedcba"

-- Завдання №2
-- Перемiшування списку з n елементiв: пiсля першого розмiстити останнiй, пiсля другого – передостаннiй тощо. Наприклад вхiдний список
-- "abcde1234"має бути трансформований у "a4b3c2d1e"

-- завдання №2 
func:: [a]->[a]
func []=[]
func (x:xs) = x : func (reverse xs)
-- :l lab_3.hs
-- func "abcdefg000"
-- "a0b0c0dgef"

-- В ході виконання лабораторної роботи ознаймлено з функціями вищого порядку 
-- мови Haskell, також було створено функцію, яка перевертає елементи списку
-- та функцію перемішування елементів списку за вказаними позиціями