-- Лабораторна робота №3
-- Студента групи АнД - 31
-- Білухи Назара Романовича
-- Варіант № 1
-- Мета: Набути досвiду визначення та використання функцiй вищого порядку.

-- завдання №1 (I варіант)
rever list = foldl (flip (:)) [] list-- Prelude.reverse [...]

-- завдання №1 (ІІ варіант)
rev :: [a] -> [a]
rev [] = []
rev (x:xs) = reverse xs

-- завдання №2 
func:: [a]->[a]
func []=[]
func (x:xs) = x : func (reverse xs)

-- В ході виконання лабораторної роботи ознаймлено з функціями вищого порядку 
-- мови Haskell, також було створено функцію, яка перевертає елементи списку
-- та функцію перемішування елементів списку за вказаними позиціями